Revit 2027 API
CompoundStructure.GetRegionIds Method
 Gets the region ids of this compound structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetRegionIds()
Public Function GetRegionIds As IList(Of Integer)
public:
IList<int>^ GetRegionIds()
member GetRegionIds : unit -> IList<int>
Return Value
IList<Int32>
 The ids of the regions defining this CompoundStructure.
Exceptions
Exception | Condition
InvalidOperationException |  This operation is valid only for vertically compound structures.
Remarks
 A vertically compound structure consists of regions with polygonal boundaries.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace